# KNN IMPUTATION FOR MISSING VALUES USING SCIKIT LEARN

# FOR NUMERICAL MISSING DATA

In [67]:
import pandas as pd
data=pd.read_csv("D:\datasets\water_potability.csv")
data.head()

,ph,Hardness,Solids,Chloramines,Sulfate,Conductivity,Organic_carbon,Trihalomethanes,Turbidity,Potability
0,NaN,204.890455,20791.318981,7.300212,368.516441,564.308654,10.379783,86.990970,2.963135,0
1,3.716080,129.422921,18630.057858,6.635246,NaN,592.885359,15.180013,56.329076,4.500656,0
2,8.099124,224.236259,19909.541732,9.275884,NaN,418.606213,16.868637,66.420093,3.055934,0
3,8.316766,214.373394,22018.417441,8.059332,356.886136,363.266516,18.436524,100.341674,4.628771,0
4,9.092223,181.101509,17978.986339,6.546600,310.135738,398.410813,11.558279,31.997993,4.075075,0

In [5]:
data.isnull().sum()

ph                 491
Hardness             0
Solids               0
Chloramines          0
Sulfate            781
Conductivity         0
Organic_carbon       0
Trihalomethanes    162
Turbidity            0
Potability           0
dtype: int64

Here in the data set there are null values in 3 features so we are going to impute the null values using knn imputer from scikit learn

In [26]:
from sklearn.impute import KNNImputer
knn=KNNImputer(n_neighbors=5,add_indicator=True)

Here we are setting neighbors as....means we are refering to 5 neighbours and will find euclidian distance with the help of 5 neighbors

add_indicater=True.........This statement will create new features which will capture the presence of null values it is called as indicator columns.

if the feature containing null value at 5th record then its corresponding indicator record will have the value 1 else 0

number of features containg null values=no of indicator columns

In [27]:
n=[i for i in data.columns if data[i].dtypes!='O']
data[n].head()

,ph,Hardness,Solids,Chloramines,Sulfate,Conductivity,Organic_carbon,Trihalomethanes,Turbidity,Potability
0,NaN,204.890455,20791.318981,7.300212,368.516441,564.308654,10.379783,86.990970,2.963135,0
1,3.716080,129.422921,18630.057858,6.635246,NaN,592.885359,15.180013,56.329076,4.500656,0
2,8.099124,224.236259,19909.541732,9.275884,NaN,418.606213,16.868637,66.420093,3.055934,0
3,8.316766,214.373394,22018.417441,8.059332,356.886136,363.266516,18.436524,100.341674,4.628771,0
4,9.092223,181.101509,17978.986339,6.546600,310.135738,398.410813,11.558279,31.997993,4.075075,0

Here the variable n is storing the list comprehension which contains the numeric values for knn calculation 

data[i].dtypes!='O' it means collect all the columns which is not having the dtype as object.

the column containing string value will have the dtype as object

In [28]:
knn.fit(data[n])

KNNImputer(add_indicator=True)

knn.fit will perform the respective calculations of knn

In [29]:
knn.transform(data[n])

array([[7.15685690e+00, 2.04890455e+02, 2.07913190e+04, ...,
        1.00000000e+00, 0.00000000e+00, 0.00000000e+00],
       [3.71608008e+00, 1.29422921e+02, 1.86300579e+04, ...,
        0.00000000e+00, 1.00000000e+00, 0.00000000e+00],
       [8.09912419e+00, 2.24236259e+02, 1.99095417e+04, ...,
        0.00000000e+00, 1.00000000e+00, 0.00000000e+00],
       ...,
       [9.41951032e+00, 1.75762646e+02, 3.31555782e+04, ...,
        0.00000000e+00, 1.00000000e+00, 0.00000000e+00],
       [5.12676292e+00, 2.30603758e+02, 1.19838694e+04, ...,
        0.00000000e+00, 1.00000000e+00, 0.00000000e+00],
       [7.87467136e+00, 1.95102299e+02, 1.74041771e+04, ...,
        0.00000000e+00, 1.00000000e+00, 0.00000000e+00]])

knn.transform will impute the learned data from knn.fit

In [30]:
d=pd.DataFrame(knn.transform(data[n])).head()
d.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12
0,7.156857,204.890455,20791.318981,7.300212,368.516441,564.308654,10.379783,86.990970,2.963135,0.0,1.0,0.0,0.0
1,3.716080,129.422921,18630.057858,6.635246,336.094350,592.885359,15.180013,56.329076,4.500656,0.0,0.0,1.0,0.0
2,8.099124,224.236259,19909.541732,9.275884,330.449166,418.606213,16.868637,66.420093,3.055934,0.0,0.0,1.0,0.0
3,8.316766,214.373394,22018.417441,8.059332,356.886136,363.266516,18.436524,100.341674,4.628771,0.0,0.0,0.0,0.0
4,9.092223,181.101509,17978.986339,6.546600,310.135738,398.410813,11.558279,31.997993,4.075075,0.0,0.0,0.0,0.0

Here we are creating a dataframe for the knn.transform data which means the data with imputed values.

before fitting there is 10 columns but after tranform there is 13 columns.....it is because the last 3 columns are the indicator columns which captures the presence of null values

In [31]:
d.isnull().sum()

0     0
1     0
2     0
3     0
4     0
5     0
6     0
7     0
8     0
9     0
10    0
11    0
12    0
dtype: int64

So now there is no null values.

# FOR CATEGORICAL MISSING DATA

For categorical missing data we want to first encode and want to perform the knn imputation

In [84]:
import pandas as pd
data4=pd.read_csv("D:\datasets\students1.csv")
data4.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [85]:
data4.loc[[1,2,5,9,100,123,345], 'parental level of education'] = np.nan

In [86]:
data4.isna().sum()

gender                         0
race/ethnicity                 0
parental level of education    7
lunch                          0
test preparation course        0
math score                     0
reading score                  0
writing score                  0
dtype: int64

In [87]:
data4.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,NaN,standard,completed,69,90,88
2,female,group B,NaN,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

### HERE I JUST REPLACED NAN WITH ORGINAL VALUES SINCE THERE IS NO NULL VALUES IN THE ACTUAL DATASET

In [88]:
data4['parental level of education'].unique()

array(["bachelor's degree", nan, "associate's degree", 'some college',
       'high school', "master's degree", 'some high school'], dtype=object)

In [89]:
order={"master's degree":1,"associate's degree":2,"bachelor's degree":3,"some college":4,"high school":5,"some high school":6}

performing ordinal encoding by using dictionaries and mapping it to the dataset

In [90]:
order

{"master's degree": 1,
 "associate's degree": 2,
 "bachelor's degree": 3,
 'some college': 4,
 'high school': 5,
 'some high school': 6}

In [91]:
data4['parent_orderencode']=data4['parental level of education'].map(order)

In [92]:
data4.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,parent_orderencode
0,female,group B,bachelor's degree,standard,none,72,72,74,3.0
1,female,group C,NaN,standard,completed,69,90,88,NaN
2,female,group B,NaN,standard,none,90,95,93,NaN
3,male,group A,associate's degree,free/reduced,none,47,57,44,2.0
4,male,group C,some college,standard,none,76,78,75,4.0

In [95]:
from sklearn.impute import KNNImputer
knn1=KNNImputer(n_neighbors=5,add_indicator=True)

In [98]:
s=[i for i in data4.columns if data4[i].dtypes!='O']
data4[s].head()

   math score  reading score  writing score  parent_orderencode
0          72             72             74                 3.0
1          69             90             88                 NaN
2          90             95             93                 NaN
3          47             57             44                 2.0
4          76             78             75                 4.0

In [99]:
knn1.fit(data4[s])

KNNImputer(add_indicator=True)

In [100]:
knn1.transform(data4[s])

array([[72. , 72. , 74. ,  3. ,  0. ],
       [69. , 90. , 88. ,  3.2,  1. ],
       [90. , 95. , 93. ,  3.4,  1. ],
       ...,
       [59. , 71. , 65. ,  5. ,  0. ],
       [68. , 78. , 77. ,  4. ,  0. ],
       [77. , 86. , 86. ,  4. ,  0. ]])

In [104]:
h=pd.DataFrame(np.round(knn1.transform(data4[s])))
h.head()

      0     1     2    3    4
0  72.0  72.0  74.0  3.0  0.0
1  69.0  90.0  88.0  3.0  1.0
2  90.0  95.0  93.0  3.0  1.0
3  47.0  57.0  44.0  2.0  0.0
4  76.0  78.0  75.0  4.0  0.0

We want to round the value since in knn we will get the float values

The values which i got from knn imputation may be wrong since i have changed the actual value to nan.......but it may work in random dataset

it is just for checking the implementation

In [105]:
h.isnull().sum()

0    0
1    0
2    0
3    0
4    0
dtype: int64

So now there is no null values